{
    "ARI": {
      "team_name": "ARIS B.C.",
      "description": "ARIS B.C., established in 1922, is one of the most historic basketball teams in Greece, based in Thessaloniki. The team rose to prominence during the 1980s, when it dominated the Greek league and competed on the European stage. ARIS B.C. is closely associated with some of the most influential figures in Greek basketball, including Nikos Galis and Panagiotis Giannakis, who helped the team achieve remarkable success. Known for their defensive intensity and passionate fan base, ARIS continues to hold a significant place in Greek basketball history.",
      "established_year": 1922,
      "stadium": "Alexandreio Melathron Nick Galis Hall",
      "capacity": 5500
    },
    "ASV": {
      "team_name": "ASVEL BASKET",
      "description": "ASVEL Basket, founded in 1948, is one of the leading basketball clubs in France, based in Villeurbanne near Lyon. Over the decades, ASVEL has cemented its reputation as a top-tier team by winning numerous French league titles and consistently competing in the EuroLeague. The club has a strong focus on developing young talent and emphasizing teamwork, which has contributed to its long-term success. With a rich history and a loyal fan base, ASVEL Basket is a key representative of French basketball at both national and European levels.",
      "established_year": 1948,
      "stadium": "Astroballe",
      "capacity": 5500
    },
    "AVE": {
      "team_name": "AIR AVELLINO",
      "description": "AIR Avellino, established in 1948, is a professional basketball team based in Avellino, Campania, Italy. The team has achieved success in the Italian Basketball League and gained recognition through its participation in various European competitions. Known for its passionate supporters and consistent effort on the court, AIR Avellino has built a strong presence in Italian basketball. The team is proud of its competitive spirit and its ability to challenge some of the top teams in the league, making it a respected name in Italian basketball history.",
      "established_year": 1948,
      "stadium": "PalaDelMauro",
      "capacity": 5300
    },
    "BAM": {
      "team_name": "Bamberg Baskets",
      "description": "Bamberg Baskets, founded in 1955, is a highly successful basketball team based in Bamberg, Germany. The club has been a dominant force in the German Basketball Bundesliga (BBL), winning multiple championships, and has also made significant strides in European competitions such as the EuroLeague. Known for their disciplined defensive play and precise offensive execution, Bamberg Baskets have become one of the most respected teams in Germany. With a modern arena and strong support from their fans, the team continues to uphold a tradition of excellence on and off the court.",
      "established_year": 1955,
      "stadium": "Brose Arena",
      "capacity": 6800
    },
    "BAR": {
      "team_name": "FC Barcelona",
      "description": "FC Barcelona, founded in 1926, is one of the most successful basketball teams in Europe and is part of the iconic FC Barcelona sports club. Based in Barcelona, Spain, the team has an illustrious history that includes numerous Spanish league championships and EuroLeague titles. Known for its dynamic and fast-paced style of play, FC Barcelona attracts top-tier talent and consistently competes at the highest levels. The team's home games are played at the Palau Blaugrana, which regularly hosts some of the most exciting matches in European basketball. With a rich legacy and a strong global fan base, FC Barcelona remains a powerhouse in European basketball.",
      "established_year": 1926,
      "stadium": "Palau Blaugrana",
      "capacity": 7500
    },
    "BAS": {
        "team_name": "Saski Baskonia",
        "description": "Saski Baskonia, also known as Cazoo Baskonia for sponsorship reasons, is a professional basketball team based in Vitoria-Gasteiz, Spain. Established in 1959, Baskonia has grown into one of the most competitive teams in the Spanish Liga ACB and the EuroLeague. Known for their strong team ethos and ability to attract international talent, Baskonia has consistently challenged for titles domestically and on the European stage. The club enjoys a dedicated fan base and has built a reputation for its resilience and exciting style of play.",
        "established_year": 1959,
        "stadium": "Fernando Buesa Arena",
        "capacity": 15200
      },
      "BER": {
        "team_name": "ALBA Berlin",
        "description": "ALBA Berlin, established in 1991, is one of the most successful basketball clubs in Germany, based in Berlin. The team has won multiple German league and cup titles and is a regular participant in the EuroLeague. Known for their fast-paced style and tactical depth, ALBA Berlin is renowned for its strong emphasis on youth development and community engagement. The team plays its home games at the Mercedes-Benz Arena, attracting one of the largest fan bases in German basketball.",
        "established_year": 1991,
        "stadium": "Mercedes-Benz Arena",
        "capacity": 14500
      },
      "BES": {
        "team_name": "Besiktas J.K.",
        "description": "Besiktas J.K. is a multi-sport club based in Istanbul, Turkey, with a basketball section that has made a significant impact both domestically and in European competitions. Established in 1933, the team has a rich history in the Turkish Basketball League and is known for its passionate fan base. Besiktas has claimed numerous Turkish league titles and continues to be a formidable opponent with its commitment to competitive excellence.",
        "established_year": 1933,
        "stadium": "Besiktas Akatlar Arena",
        "capacity": 3200
      },
      "BIL": {
        "team_name": "Bilbao Basket",
        "description": "Bilbao Basket, established in 2000, is a professional basketball club based in Bilbao, Spain. Despite being a relatively young team, Bilbao Basket has quickly made a name for itself in the Spanish Liga ACB with several strong performances and a dedicated following. The team is known for its tenacity and competitive spirit, which have helped it compete against some of the top teams in Spain and Europe. The club plays its home games at the Bilbao Arena, where fans create a vibrant and supportive atmosphere.",
        "established_year": 2000,
        "stadium": "Bilbao Arena",
        "capacity": 10000
      },
      "BUD": {
        "team_name": "Buducnost",
        "description": "Buducnost VOLI is a professional basketball team based in Podgorica, Montenegro. Founded in 1949, the team is one of the most successful clubs in the Adriatic League and has also made its mark in European competitions. Buducnost is known for its disciplined defense and tactical approach, which have earned it numerous league titles. The club has a strong fan base and plays its home games at the Moraca Sports Center, providing an electric atmosphere for its matches.",
        "established_year": 1949,
        "stadium": "Moraca Sports Center",
        "capacity": 5200
      },
      "CAN": {
        "team_name": "C.B. Gran Canaria",
        "description": "C.B. Gran Canaria, based in Las Palmas, Spain, is a prominent basketball club established in 1963. The team has built a reputation as a consistent competitor in the Spanish Liga ACB and has made appearances in European tournaments like the EuroCup. Known for its balanced gameplay and focus on player development, Gran Canaria is a respected name in Spanish basketball. The team enjoys strong support from its local fan base and plays its home games at the Gran Canaria Arena.",
        "established_year": 1963,
        "stadium": "Gran Canaria Arena",
        "capacity": 11400
      },
      "CED": {
        "team_name": "Cedevita Junior",
        "description": "Cedevita Junior, based in Zagreb, Croatia, is a competitive basketball team that emerged from a strong basketball tradition in the region. Established in 1991, the team has achieved success in the Croatian Basketball League and the ABA League. Known for their disciplined approach and emphasis on teamwork, Cedevita Junior has also developed young talent that has gone on to excel in European basketball.",
        "established_year": 1991,
        "stadium": "Drazen Petrovic Basketball Hall",
        "capacity": 5400
      },
      "CHA": {
        "team_name": "Spirou Charleroi",
        "description": "Spirou Charleroi is a basketball team based in Charleroi, Belgium, with a history dating back to 1989. The team has been one of the most successful in Belgian basketball, winning multiple national championships and competing in European tournaments. Spirou Charleroi is recognized for its high-energy gameplay and strong fan support, making it a challenging opponent in both domestic and international competitions.",
        "established_year": 1989,
        "stadium": "Spiroudome",
        "capacity": 6300
      },
      "CHL": {
        "team_name": "Elan Chalon",
        "description": "Elan Chalon, based in Chalon-sur-Saône, France, is a basketball team with a rich history in French basketball. Founded in 1955, the team has won multiple French league titles and has represented France in European competitions. Known for its efficient offensive play and tactical acumen, Elan Chalon is a respected name in both domestic and international basketball.",
        "established_year": 1955,
        "stadium": "Colisée de Chalon-sur-Saône",
        "capacity": 5000
      },
      "CHO": {
        "team_name": "Cholet Basket",
        "description": "Cholet Basket, founded in 1975, is a professional basketball team based in Cholet, France. The team is known for its competitive spirit in the French Pro A league and has a history of developing young players who have gone on to succeed in European basketball. Cholet Basket has won French championships and remains a strong contender in domestic competitions, supported by its loyal fan base.",
        "established_year": 1975,
        "stadium": "La Meilleraie",
        "capacity": 5200
      },
      "CIB": {
        "team_name": "Cibona",
        "description": "Cibona, based in Zagreb, Croatia, is one of the most successful basketball teams in the region. Founded in 1946, the team has a storied history in European basketball, with multiple championships in the Yugoslav League and the Croatian League. Known for its disciplined play and strong emphasis on teamwork, Cibona has been a breeding ground for talent, contributing significantly to the European basketball landscape.",
        "established_year": 1946,
        "stadium": "Drazen Petrovic Basketball Hall",
        "capacity": 5400
      },
      "CSK": {
        "team_name": "CSKA Moscow",
        "description": "CSKA Moscow is a powerhouse in European basketball, based in Moscow, Russia. Established in 1924, the team has dominated the Russian Basketball League and is a regular contender in the EuroLeague. Known for its consistent excellence, CSKA Moscow combines tactical precision with a roster of elite players, making it one of the most respected clubs in international basketball.",
        "established_year": 1924,
        "stadium": "Megasport Arena",
        "capacity": 13000
      },
      "CTU": {
        "team_name": "Pallacanestro Cantù",
        "description": "Pallacanestro Cantù, located in Cantù, Italy, is a historic basketball team with a legacy of success in Italian and European competitions. Founded in 1936, the club has won multiple Italian league titles and European trophies, showcasing a strong tradition of basketball excellence. Known for its passionate fan base and strategic gameplay, Pallacanestro Cantù continues to be a respected name in basketball.",
        "established_year": 1936,
        "stadium": "PalaDesio",
        "capacity": 6200
      },
      "DAR": {
        "team_name": "Darussafaka",
        "description": "Darussafaka, based in Istanbul, Turkey, is a well-regarded basketball club with a focus on both competitive success and community impact. Established in 1914, the team has gained prominence in the Turkish Basketball League and has made its mark in European competitions, including a EuroCup championship. Known for its structured approach and tactical play, Darussafaka continues to be a strong contender on multiple fronts.",
        "established_year": 1914,
        "stadium": "Volkswagen Arena",
        "capacity": 5000
      },
      "DYR": {
        "team_name": "Zenit St Petersburg",
        "description": "Zenit St Petersburg, based in St. Petersburg, Russia, is a prominent basketball club known for its competitive edge in the VTB United League and the EuroLeague. Founded in 2014, the team has quickly established itself as a strong competitor in European basketball, earning respect for its efficient gameplay and well-rounded roster. Zenit represents the modern face of Russian basketball with a growing legacy.",
        "established_year": 2014,
        "stadium": "Sibur Arena",
        "capacity": 7120
      },
      "GAL": {
        "team_name": "Galatasaray",
        "description": "Galatasaray, based in Istanbul, Turkey, is one of the most iconic basketball teams in the Turkish Basketball League. Established in 1911 as part of the larger Galatasaray Sports Club, the team has enjoyed success both domestically and in European competitions. Known for its passionate fan base and competitive spirit, Galatasaray emphasizes teamwork and resilience on the court.",
        "established_year": 1911,
        "stadium": "Sinan Erdem Dome",
        "capacity": 16000
      },
      "GSS": {
        "team_name": "Stelmet Zielona Gora",
        "description": "Stelmet Zielona Gora, based in Zielona Góra, Poland, is a prominent basketball club with a reputation for excellence in the Polish Basketball League. Founded in 1946, the team has achieved multiple domestic championships and has represented Poland in various European tournaments. Known for its disciplined approach and strategic play, Stelmet Zielona Gora continues to be a leading force in Polish basketball.",
        "established_year": 1946,
        "stadium": "CRS Hall Zielona Góra",
        "capacity": 5000
      },
      "IST": {
        "team_name": "Anadolu Efes",
        "description": "Anadolu Efes, located in Istanbul, Turkey, is one of the most successful basketball teams in Turkish and European basketball history. Established in 1976, the team has won numerous Turkish league titles and EuroLeague championships. Known for its dynamic playing style and a roster featuring top international talent, Anadolu Efes is a powerhouse that consistently competes at the highest levels.",
        "established_year": 1976,
        "stadium": "Sinan Erdem Dome",
        "capacity": 16000
      },
      "JOV": {
        "team_name": "Joventut Badalona",
        "description": "Joventut Badalona, based in Badalona, Spain, is a historic basketball club with a rich legacy in Spanish and European basketball. Established in 1930, the team has been a consistent competitor in the Spanish Liga ACB and has claimed several European titles. Joventut is renowned for its emphasis on player development and its tradition of fast-paced, skillful basketball.",
        "established_year": 1930,
        "stadium": "Palau Municipal d'Esports de Badalona",
        "capacity": 12160
      },
      "KHI": {
        "team_name": "BC Khimki",
        "description": "BC Khimki, located in Khimki, Russia, is a leading basketball team known for its achievements in the VTB United League and its participation in the EuroLeague. Founded in 1997, the team is recognized for its tactical prowess and competitive roster. BC Khimki has established itself as a strong contender in both domestic and international competitions.",
        "established_year": 1997,
        "stadium": "Basketball Center of Moscow Region",
        "capacity": 5000
      },
      "KLA": {
        "team_name": "Neptunas Klaipeda",
        "description": "Neptunas Klaipeda, based in Klaipeda, Lithuania, is a well-regarded team in the Lithuanian Basketball League. Established in 1964, the team has a history of competitive performances both domestically and in European tournaments. Known for its disciplined style of play and passionate local fan base, Neptunas Klaipeda continues to represent the basketball-rich culture of Lithuania.",
        "established_year": 1964,
        "stadium": "Švyturys Arena",
        "capacity": 5000
      },
      "KSK": {
        "team_name": "Karsiyaka Basket",
        "description": "Karsiyaka Basket, officially known as Pınar Karşıyaka, is a prominent basketball club located in Izmir, Turkey. Founded in 1966, the team has achieved success in the Turkish Basketball League and has made notable appearances in European competitions. Renowned for its tenacity and strong defensive play, Karsiyaka Basket is supported by a fervent fan base that energizes its home games.",
        "established_year": 1966,
        "stadium": "Karşıyaka Arena",
        "capacity": 5000
      },
      "LEM": {
        "team_name": "Le Mans",
        "description": "Le Mans Sarthe Basket, based in Le Mans, France, is a respected team in the French Basketball League. Established in 1939, the club has a rich history of domestic success and participation in European tournaments. Known for its balanced approach to the game and strong fundamentals, Le Mans continues to be a key player in French basketball.",
        "established_year": 1939,
        "stadium": "Antarès",
        "capacity": 6003
      },
      "LIE": {
        "team_name": "Rytas Vilnius",
        "description": "Rytas Vilnius, formerly known as Lietuvos Rytas, is a top-tier basketball club from Vilnius, Lithuania. Founded in 1997, the team has consistently competed at a high level in the Lithuanian Basketball League and European competitions. Known for its strategic gameplay and passionate supporters, Rytas Vilnius is a proud representative of Lithuanian basketball excellence.",
        "established_year": 1997,
        "stadium": "Jeep Arena",
        "capacity": 2500
      },
      "LJU": {
        "team_name": "KK Olimpija",
        "description": "KK Olimpija, based in Ljubljana, Slovenia, is one of the most successful basketball teams in Slovenian history. Established in 1946, the club has won numerous Slovenian league titles and has been a consistent participant in European competitions. Known for its strong team spirit and effective game strategies, KK Olimpija is a cornerstone of Slovenian basketball.",
        "established_year": 1946,
        "stadium": "Stožice Arena",
        "capacity": 12500
      },
      "LMG": {
        "team_name": "Limoges CSP",
        "description": "Limoges CSP is a historic basketball club based in Limoges, France. Established in 1929, it is one of the most successful teams in French basketball history. Limoges CSP gained international recognition by winning the EuroLeague in 1993, a significant achievement for a French club. Known for its strong defensive play and disciplined approach, the team remains a prominent name in European basketball.",
        "established_year": 1929,
        "stadium": "Palais des Sports de Beaublanc",
        "capacity": 6100
      },
      "MAD": {
        "team_name": "Real Madrid",
        "description": "Real Madrid Baloncesto is the basketball division of the iconic Real Madrid football club. Based in Madrid, Spain, the team was established in 1931 and is one of the most successful basketball clubs in Europe. Real Madrid has won numerous Spanish League titles and holds a record number of EuroLeague championships. Known for its fast-paced and high-scoring style of play, Real Madrid consistently competes at the highest level of European basketball.",
        "established_year": 1931,
        "stadium": "WiZink Center",
        "capacity": 17300
      },
      "MAL": {
        "team_name": "Baloncesto Malaga",
        "description": "Baloncesto Malaga, commonly known as Unicaja, is a professional basketball team based in Malaga, Spain. Founded in 1977, the team has achieved success in the Spanish League and European competitions, including winning the EuroCup in 2017. Known for its strong home-court advantage and dynamic style of play, Baloncesto Malaga continues to be a competitive force in European basketball.",
        "established_year": 1977,
        "stadium": "Palacio de Deportes José María Martín Carpena",
        "capacity": 11000
      },
      "MAR": {
        "team_name": "Maroussi B.C.",
        "description": "Maroussi B.C. is a basketball club based in Marousi, a suburb of Athens, Greece. Founded in 1950, the team has a rich history of domestic and international competition. Known for its strategic gameplay and focus on developing young talent, Maroussi has made notable appearances in the Greek Basketball League and European tournaments.",
        "established_year": 1950,
        "stadium": "Maroussi Indoor Hall",
        "capacity": 2000
      },
      "MCO": {
        "team_name": "AS Monaco",
        "description": "AS Monaco Basket, based in the principality of Monaco, is a rising powerhouse in European basketball. Founded in 1928, the team has gained prominence in recent years, winning the EuroCup in 2021 and competing in the EuroLeague. Known for its athleticism and aggressive style of play, AS Monaco continues to grow as a competitive force on the international stage.",
        "established_year": 1928,
        "stadium": "Salle Gaston Médecin",
        "capacity": 5000
      },
      "MIL": {
        "team_name": "Olimpia Milano",
        "description": "Olimpia Milano, also known as AX Armani Exchange Milano, is one of the most storied basketball teams in Europe. Based in Milan, Italy, and founded in 1936, the team has won multiple Italian championships and three EuroLeague titles. Known for its disciplined approach and tactical gameplay, Olimpia Milano remains a dominant force in both domestic and European competitions.",
        "established_year": 1936,
        "stadium": "Mediolanum Forum",
        "capacity": 12700
      },
      "MUN": {
        "team_name": "FC Bayern Munich",
        "description": "FC Bayern Munich is a prominent basketball club based in Munich, Germany. Founded in 1946, the team is affiliated with the world-famous FC Bayern Munich football club. Over the years, FC Bayern has become a competitive force in the German Basketball Bundesliga and the EuroLeague, known for its balanced play and strong defensive performances.",
        "established_year": 1946,
        "stadium": "Audi Dome",
        "capacity": 6700
      },
      "NAN": {
        "team_name": "SLUC Nancy",
        "description": "SLUC Nancy is a professional basketball team based in Nancy, France. Established in 1967, the team has been a consistent competitor in the French Basketball League. Known for its emphasis on team cohesion and fan support, SLUC Nancy has achieved success in domestic competitions and continues to be a respected name in French basketball.",
        "established_year": 1967,
        "stadium": "Palais des Sports Jean Weille",
        "capacity": 6000
      },
      "NIK": {
        "team_name": "BC Budivelnik",
        "description": "BC Budivelnik, based in Kyiv, Ukraine, is one of the most successful basketball teams in Ukrainian history. Founded in 1945, the team has won numerous Ukrainian championships and has represented the country in various European competitions. Known for its resilience and adaptability, BC Budivelnik remains a respected competitor in the European basketball landscape.",
        "established_year": 1945,
        "stadium": "Palace of Sports",
        "capacity": 7000
      },
      "NIO": {
        "team_name": "Panionios B.C.",
        "description": "Panionios B.C. is a basketball club based in Nea Smyrni, Athens, Greece. Founded in 1919, the team is one of the oldest and most respected basketball clubs in Greece. Known for its strong ties to the local community and emphasis on developing young talent, Panionios has been a steady competitor in the Greek Basketball League and European tournaments.",
        "established_year": 1919,
        "stadium": "Nea Smyrni Indoor Hall",
        "capacity": 2000
      },
      "NOV": {
        "team_name": "Nizhny Novgorod",
        "description": "Nizhny Novgorod is a basketball team based in Nizhny Novgorod, Russia. Established in 2000, the team has quickly risen to prominence in Russian basketball, known for its competitive spirit and focus on teamwork. They have represented Russia in various European competitions, earning a reputation as a formidable and resilient club.",
        "established_year": 2000,
        "stadium": "Trade Union Sport Palace",
        "capacity": 5600
      },
      "NTR": {
        "team_name": "JSF Nanterre",
        "description": "JSF Nanterre, based in Nanterre, France, is a professional basketball club founded in 1927. Known for its incredible rise to prominence in the early 2010s, the team has achieved notable success in the French Basketball League and European competitions. JSF Nanterre is celebrated for its exciting playing style and commitment to nurturing young talent.",
        "established_year": 1927,
        "stadium": "Palais des Sports Maurice Thorez",
        "capacity": 3000
      },
      "OLD": {
        "team_name": "EWE Baskets",
        "description": "EWE Baskets, based in Oldenburg, Germany, is a well-established basketball club with a strong presence in the German Basketball Bundesliga. Founded in 1954, the team has consistently been a competitive force domestically and has also participated in European tournaments. Known for its disciplined play and passionate fan base, EWE Baskets is a respected name in German basketball.",
        "established_year": 1954,
        "stadium": "EWE Arena",
        "capacity": 6000
      },
      "OLY": {
        "team_name": "Olympiacos Piraeus",
        "description": "Olympiacos Piraeus, based in Piraeus, Greece, is one of the most successful basketball teams in Europe. Founded in 1931, the team has won multiple Greek championships and EuroLeague titles. Known for its passionate fan base and fierce competitiveness, Olympiacos is a perennial contender in both domestic and European basketball.",
        "established_year": 1931,
        "stadium": "Peace and Friendship Stadium",
        "capacity": 11400
      },
      "ORL": {
        "team_name": "Entente Orléanaise",
        "description": "Entente Orléanaise is a basketball team based in Orléans, France. Established in 1993, the club has competed in the French Basketball League and various European tournaments. Known for its strong work ethic and team-oriented play, Entente Orléanaise has earned a loyal following among basketball fans in France.",
        "established_year": 1993,
        "stadium": "Palais des Sports",
        "capacity": 3500
      },
      "PAM": {
        "team_name": "Valencia Basket",
        "description": "Valencia Basket is a professional basketball team based in Valencia, Spain. Established in 1986, the club has become a strong competitor in both Spanish and European basketball leagues. Known for its consistent performances and strong roster, Valencia Basket has won multiple European titles and continues to be a respected force in international basketball.",
        "established_year": 1986,
        "stadium": "Pabellón Fuente de San Luis",
        "capacity": 9000
      },
      "PAN": {
        "team_name": "Panathinaikos B.C.",
        "description": "Panathinaikos B.C., based in Athens, Greece, is one of the most storied basketball teams in Europe. Founded in 1919, the club has achieved immense success, including numerous Greek championships and EuroLeague titles. Panathinaikos is known for its passionate fan base, rich history, and a legacy of excellence in European basketball.",
        "established_year": 1919,
        "stadium": "OAKA Olympic Indoor Hall",
        "capacity": 18900
      },
      "PAR": {
        "team_name": "Partizan Belgrade",
        "description": "Partizan Belgrade is a historic basketball club from Belgrade, Serbia. Established in 1945, the team has a proud tradition of success, including multiple domestic and European titles. Partizan is renowned for its strong youth development program and passionate supporters, making it a cornerstone of Serbian and European basketball.",
        "established_year": 1945,
        "stadium": "Štark Arena",
        "capacity": 18386
      },
      "PRS": {
        "team_name": "Paris Basketball",
        "description": "Paris Basketball, based in Paris, France, is a relatively young basketball team founded in 2018. Despite its recent establishment, the club is quickly making a name for itself in the French Basketball League. Paris Basketball represents the growing basketball culture in the French capital, aiming to achieve both domestic and international success.",
        "established_year": 2018,
        "stadium": "Halle Georges Carpentier",
        "capacity": 5000
      },
      "RED": {
        "team_name": "Crvena Zvezda",
        "description": "Crvena Zvezda, also known as Red Star Belgrade, is a legendary basketball team from Belgrade, Serbia. Founded in 1945, the club has won numerous domestic and regional titles and is a prominent competitor in the EuroLeague. Known for its fiery atmosphere at home games and a roster filled with talent, Crvena Zvezda is a key player in European basketball.",
        "established_year": 1945,
        "stadium": "Aleksandar Nikolić Hall",
        "capacity": 8000
      },
      "ROA": {
        "team_name": "Chorale Roanne",
        "description": "Chorale Roanne is a basketball team based in Roanne, France. Established in 1937, the club has a long history in French basketball, including multiple appearances in the French top division. Known for its strong team spirit and commitment to the game, Chorale Roanne continues to contribute to the growth of basketball in France.",
        "established_year": 1937,
        "stadium": "Halle André-Vacheresse",
        "capacity": 5200
      },
      "ROM": {
        "team_name": "Virtus Roma",
        "description": "Virtus Roma, based in Rome, Italy, was one of the most iconic basketball teams in the country. Founded in 1960, the club achieved success in domestic and European competitions, including a EuroLeague title. Although the team ceased operations in 2020, Virtus Roma remains a memorable name in Italian basketball history.",
        "established_year": 1960,
        "stadium": "PalaLottomatica",
        "capacity": 11500
      },
      "SAS": {
        "team_name": "Dinamo Sassari",
        "description": "Dinamo Sassari is a professional basketball team based in Sassari, Sardinia, Italy. Established in 1960, the club has become a strong contender in the Italian Basketball League and European competitions. Known for its dynamic playing style and passionate fan base, Dinamo Sassari represents the pride of Sardinian basketball.",
        "established_year": 1960,
        "stadium": "PalaSerradimigni",
        "capacity": 5000
      },
      "SIE": {
        "team_name": "Montepaschi Siena",
        "description": "Montepaschi Siena was a dominant force in Italian basketball, based in Siena, Italy. Founded in 1934, the team achieved remarkable success, including multiple Italian league titles and strong performances in the EuroLeague. Although the club faced financial challenges and was reformed, Montepaschi Siena's legacy as one of Italy's top basketball teams endures.",
        "established_year": 1934,
        "stadium": "PalaEstra",
        "capacity": 5100
      },
      "SOP": {
        "team_name": "Prokom Trefl Sopot",
        "description": "Prokom Trefl Sopot was a prominent basketball team from Sopot, Poland. Established in 1995, the club was known for its dominance in Polish basketball and its participation in the EuroLeague. Prokom Trefl Sopot played a key role in popularizing basketball in Poland, earning recognition on both domestic and European stages.",
        "established_year": 1995,
        "stadium": "Ergo Arena",
        "capacity": 11000
      },
      "STR": {
        "team_name": "SIG Strasbourg",
        "description": "SIG Strasbourg, based in Strasbourg, France, is a respected basketball club with a strong presence in French and European competitions. Established in 1928, the team is known for its disciplined approach to the game and a focus on teamwork. SIG Strasbourg has been a consistent contender in the French Basketball League, earning recognition as one of the top teams in the country.",
        "established_year": 1928,
        "stadium": "Rhenus Sport",
        "capacity": 6200
      },
      "TEL": {
        "team_name": "Maccabi Tel Aviv",
        "description": "Maccabi Tel Aviv is one of the most iconic basketball teams in Europe, based in Tel Aviv, Israel. Founded in 1932, the club has an illustrious history, including numerous domestic championships and EuroLeague titles. Known for its passionate fan base and high-paced playing style, Maccabi Tel Aviv is a dominant force in European basketball.",
        "established_year": 1932,
        "stadium": "Menora Mivtachim Arena",
        "capacity": 10500
      },
      "TIV": {
        "team_name": "Lokomotiv Kuban",
        "description": "Lokomotiv Kuban is a prominent basketball team based in Krasnodar, Russia. Established in 1946, the team has achieved success in the VTB United League and European competitions, including winning the EuroCup. Known for their strategic gameplay and skilled roster, Lokomotiv Kuban continues to make its mark in international basketball.",
        "established_year": 1946,
        "stadium": "Basket-Hall Krasnodar",
        "capacity": 7500
      },
      "ULK": {
        "team_name": "Fenerbahçe",
        "description": "Fenerbahçe is a powerhouse in Turkish basketball, based in Istanbul, Turkey. Founded in 1913, the club has achieved tremendous success both domestically and internationally, including a EuroLeague championship in 2017. Known for its star-studded rosters and passionate supporters, Fenerbahçe represents excellence in European basketball.",
        "established_year": 1913,
        "stadium": "Ülker Sports and Event Hall",
        "capacity": 13000
      },
      "UNK": {
        "team_name": "UNICS Kazan",
        "description": "UNICS Kazan is a professional basketball team based in Kazan, Russia. Established in 1991, the club has become a major contender in the VTB United League and European competitions, including winning the EuroCup. Known for their defensive intensity and well-rounded gameplay, UNICS Kazan is a formidable presence in international basketball.",
        "established_year": 1991,
        "stadium": "Basket-Hall Kazan",
        "capacity": 7000
      },
      "VIR": {
        "team_name": "Virtus Pallacanestro Bologna",
        "description": "Virtus Pallacanestro Bologna, based in Bologna, Italy, is one of the most storied basketball clubs in Europe. Established in 1929, the team has a rich history that includes multiple Italian championships and EuroLeague titles. Known for their technical gameplay and deep roster, Virtus Bologna remains a dominant force in both domestic and international basketball.",
        "established_year": 1929,
        "stadium": "Segafredo Arena",
        "capacity": 9500
      },
      "ZAG": {
        "team_name": "Zagreb",
        "description": "Zagreb, based in the capital of Croatia, is a competitive basketball team known for its focus on developing local talent. Established in 1970, the team has earned recognition in the Adriatic League and Croatian Basketball League. Zagreb's commitment to nurturing young players has made it a key contributor to Croatian basketball.",
        "established_year": 1970,
        "stadium": "Dražen Petrović Basketball Hall",
        "capacity": 5400
      },
      "ZAL": {
        "team_name": "Zalgiris Kaunas",
        "description": "Zalgiris Kaunas, based in Kaunas, Lithuania, is a historic basketball club with a legacy of excellence. Established in 1944, the team has won numerous Lithuanian championships and remains a consistent contender in the EuroLeague. Known for their disciplined play and passionate fan base, Zalgiris is a cornerstone of Lithuanian basketball.",
        "established_year": 1944,
        "stadium": "Žalgiris Arena",
        "capacity": 15552
      },
      "ZGO": {
        "team_name": "Turow Zgorzelec",
        "description": "Turow Zgorzelec is a professional basketball team based in Zgorzelec, Poland. Established in 1948, the club has achieved success in the Polish Basketball League and has represented Poland in various European competitions. Known for their resilience and competitive spirit, Turow Zgorzelec has made its mark in Polish basketball history.",
        "established_year": 1948,
        "stadium": "PGE Turów Arena",
        "capacity": 3500
      }
}